/*
Написать программу, которая конкурентно рассчитает значение квадратов чисел взятых из массива (2,4,6,8,10) и выведет их квадраты в stdout.
*/

package main

import (
	"fmt"
	"io"
	"os"
	"time"
)

func K(w io.Writer, numbers ...int) {
	// Выводим значения с помощью go и анонимной фукции. Важно передать val как параметр v, а не переменную val используя хамыкания, так как во время работы циклы это переменная меняет значения 
	for _, val := range numbers {
		go func(v int) {
			fmt.Fprintln(w, v*v)
		}(val)
	}
}

func main() {
	K(os.Stdout, 2, 4, 6, 8, 10)
	// Ждем чтобы все подсчиталось
	time.Sleep(time.Second * 2)
}
