package main

import (
	"fmt" // пакет для форматированного ввода/вывода
)

func main() {
	// Исходный список чисел с плавающей точкой
	nums := []float32{-25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5}

	// Словарь для хранения сгруппированных чисел
	m := make(map[int][]float32)

	// Перебор чисел из `nums`
	for _, fVal := range nums {
		// Получение целой части числа (отбрасывание дробной)
		iVal := int(fVal) - int(fVal)%10

		// Проверка наличия ключа `iVal` в словаре
		if _, ok := m[iVal]; ok { // ok - флаг наличия ключа
			// Если ключ существует, добавляем текущее число к списку значений
			m[iVal] = append(m[iVal], fVal)
			continue // Переход к следующей итерации цикла
		}

		// Если ключа нет, создаем новый список значений с текущим числом
		m[iVal] = []float32{fVal}
	}

	// Печать словаря (отображает сгруппированные числа)
	fmt.Print(m)
}
