package main

import (
	"fmt"     // пакет для форматированного ввода/вывода
	"strings" // пакет для работы со строками
)

// TurnsWordsOver - функция для переворота порядка слов в строке
func TurnsWordsOver(s string) []string {
	// words - список слов, полученный из исходной строки
	words := strings.Fields(s) // Разделение строки на слова по разделителям (пробелы, табуляция и т.д.)

	// turnsWords - массив строк для хранения перевернутых слов
	turnsWords := make([]string, len(words)) // Создание массива строк нужной длины

	// Цикл для переворота порядка слов
	for i := 0; i < len(words); i++ {
		// turnsWords[len(words)-1-i] - индекс для записи перевернутого слова
		// (индекс с конца массива)
		turnsWords[len(words)-1-i] = words[i] // Запись слова из исходного списка в перевернутый массив
	}

	// Возврат массива перевернутых слов
	return turnsWords
}

func main() {
	// Исходная строка
	s := "marat add ll  23"

	// turnWordLine - массив перевернутых слов
	turnWordLine := TurnsWordsOver(s)

	// Печать перевернутых слов
	for _, a := range turnWordLine {
		fmt.Print(a + " ") // Печать каждого слова с пробелом
	}

	// Дополнительный цикл, не связанный с переворотом слов (выводит числа от 0 до 24)
	for i := 0; i < 25; i++ {
		fmt.Println(i) // Печать каждого числа с новой строки
	}
}
