package main

import "fmt" // Пакет для форматированного ввода/вывода

func turnsLine(s string) string {
	// Преобразование строки в руны (массив символов)
	r := []rune(s)

	// Цикл перебора половины длины строки
	for i := 0; i < len(r)/2; i++ {
		// Сохранение текущего символа
		a := r[i]

		// Замена текущего символа на символ с симметричного индекса
		r[i] = r[len(r)-i-1]

		// Замена симметричного символа на сохраненный ранее
		r[len(r)-i-1] = a
	}

	// Возвращение строки из рун
	return string(r)
}

func main() {
	// Пример использования функции
	a := "абвдгsdaf"
	fmt.Print(turnsLine(a)) // Вывод перевернутой строки "fdgasdvba"
}
